//Напишите программу, 
// 1. будет выдавать название дня недели
// по заданному номеру
// 3 -> среда
// 5 -> пятница

Console.WriteLine("Hello, World!");
